In [2]:
# Load and activate the SQL extension to allow us to execute SQL in a Jupyter notebook. 

%load_ext sql

In [3]:
# Establish a connection to the local database using the '%sql' magic command
%sql mysql+pymysql://root:ek.05w4242@localhost:3306/md_water_services

#### Cleaning the data 
Update the employee table email column with an appropriate email address. 
1. The email  should be in the format: first_name.last_name@ndogowater.gov
2. The

In [65]:
%%sql 
-- show the emplyee table 

SELECT 
    *
FROM
    employee
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[(0, 'Amara Jengo', '+99637993287', 'amara.jengo@ndogowater.gov', '36 Pwani Mchangani Road', 'Sokoto', 'Ilanga', 'Field Surveyor'),
 (1, 'Bello Azibo', '+99643864786', 'bello.azibo@ndogowater.gov', '129 Ziwa La Kioo Road', 'Kilimani', 'Rural', 'Field Surveyor'),
 (2, 'Bakari Iniko', '+99222599041', 'bakari.iniko@ndogowater.gov', '18 Mlima Tazama Avenue', 'Hawassa', 'Rural', 'Field Surveyor'),
 (3, 'Malachi Mavuso', '+99945849900', 'malachi.mavuso@ndogowater.gov', '100 Mogadishu Road', 'Akatsi', 'Lusaka', 'Field Surveyor'),
 (4, 'Cheche Buhle', '+99381679640', 'cheche.buhle@ndogowater.gov', '1 Savanna Street', 'Akatsi', 'Rural', 'Field Surveyor')]

In [66]:
%%sql 
-- Replace the space in the employee name with full stop

SELECT 
    REPLACE(employee_name, ' ', '.') AS new_employee_name
FROM 
    employee
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('Amara.Jengo',),
 ('Bello.Azibo',),
 ('Bakari.Iniko',),
 ('Malachi.Mavuso',),
 ('Cheche.Buhle',)]

In [67]:
%%sql 
-- Make all the names lower 

SELECT 
    LOWER(REPLACE(employee_name, ' ', '.')) AS new_employee_name_lower
FROM 
    employee
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('amara.jengo',),
 ('bello.azibo',),
 ('bakari.iniko',),
 ('malachi.mavuso',),
 ('cheche.buhle',)]

In [68]:
%%sql 
-- Use CONACT to add the rest of the email address

SELECT 
    CONCAT(
    LOWER(REPLACE(employee_name, ' ', '.')), '@ndogowater.gov') AS new_email
FROM 
    employee
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('amara.jengo@ndogowater.gov',),
 ('bello.azibo@ndogowater.gov',),
 ('bakari.iniko@ndogowater.gov',),
 ('malachi.mavuso@ndogowater.gov',),
 ('cheche.buhle@ndogowater.gov',)]

In [69]:
%%sql 
-- Update the email column with the email address

UPDATE employee
SET email = CONCAT(
    LOWER(REPLACE(employee_name, ' ', '.')), '@ndogowater.gov')

 * mysql+pymysql://root:***@localhost:3306/md_water_services
56 rows affected.

[]

In [70]:
%%sql 
-- Show the employee table 

SELECT 
    *
FROM
    employee
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[(0, 'Amara Jengo', '+99637993287', 'amara.jengo@ndogowater.gov', '36 Pwani Mchangani Road', 'Sokoto', 'Ilanga', 'Field Surveyor'),
 (1, 'Bello Azibo', '+99643864786', 'bello.azibo@ndogowater.gov', '129 Ziwa La Kioo Road', 'Kilimani', 'Rural', 'Field Surveyor'),
 (2, 'Bakari Iniko', '+99222599041', 'bakari.iniko@ndogowater.gov', '18 Mlima Tazama Avenue', 'Hawassa', 'Rural', 'Field Surveyor'),
 (3, 'Malachi Mavuso', '+99945849900', 'malachi.mavuso@ndogowater.gov', '100 Mogadishu Road', 'Akatsi', 'Lusaka', 'Field Surveyor'),
 (4, 'Cheche Buhle', '+99381679640', 'cheche.buhle@ndogowater.gov', '1 Savanna Street', 'Akatsi', 'Rural', 'Field Surveyor')]

In [71]:
%%sql 
-- Check the length of the Phone numbers 

SELECT 
    LENGTH(phone_number) AS length_phone_number
FROM 
    employee
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[(12,), (12,), (12,), (12,), (12,)]

In [72]:
%%sql 
-- Removes leading and trailing spaces on the phone_number column a

SELECT 
    TRIM(phone_number) AS trimmed_phone_number
FROM
    employee
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('+99637993287',),
 ('+99643864786',),
 ('+99222599041',),
 ('+99945849900',),
 ('+99381679640',)]

In [73]:
%%sql 
-- Updates the employee table with the trimmed phone_number column 

UPDATE employee
SET phone_number = TRIM(phone_number)

 * mysql+pymysql://root:***@localhost:3306/md_water_services
56 rows affected.

[]

#### Honouring the Workers

In [74]:
%%sql 
-- Counts the number of employees per town 

SELECT 
    town_name,
    COUNT(employee_name) AS num_employee_per_town
FROM 
    employee
GROUP BY
    town_name
LIMIT 10;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
9 rows affected.

[('Ilanga', 3),
 ('Rural', 29),
 ('Lusaka', 4),
 ('Zanzibar', 4),
 ('Dahabu', 6),
 ('Kintampo', 1),
 ('Harare', 5),
 ('Yaounde', 1),
 ('Serowe', 3)]

In [75]:
%%sql 
-- Identify the employees with the most visits 

SELECT 
    assigned_employee_id,
    COUNT(visit_count) AS num_visits
FROM 
    visits
GROUP BY 
    assigned_employee_id
ORDER BY 
    COUNT(visit_count) DESC
LIMIT 3;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
3 rows affected.

[(1, 3708), (30, 3676), (34, 3539)]

#### Analysing Locations

In [76]:
%%sql 
-- Number of records per town 

SELECT 
    town_name,
    COUNT(town_name) AS records_per_town
FROM
    location
GROUP BY 
    town_name
ORDER BY 
    COUNT(town_name) DESC
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('Rural', 23740),
 ('Harare', 1650),
 ('Amina', 1090),
 ('Lusaka', 1070),
 ('Mrembo', 990)]

In [77]:
%%sql 
-- Number of records per Provinvce 

SELECT 
    province_name,
    COUNT(province_name) AS records_per_rovince
FROM
    location
GROUP BY 
    province_name
ORDER BY 
    COUNT(province_name) DESC
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('Kilimani', 9510),
 ('Akatsi', 8940),
 ('Sokoto', 8220),
 ('Amanzi', 6950),
 ('Hawassa', 6030)]

In [78]:
%%sql 
-- Result set of Province names, towns in each province and the number of records_per_towns

SELECT 
    province_name,
    town_name,
    COUNT(town_name) AS records_per_town
FROM
    location
GROUP BY 
    Province_name,
    town_name
ORDER BY
    Province_name,
    COUNT(town_name) DESC
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('Akatsi', 'Rural', 6290),
 ('Akatsi', 'Lusaka', 1070),
 ('Akatsi', 'Harare', 800),
 ('Akatsi', 'Kintampo', 780),
 ('Amanzi', 'Rural', 3100)]

In [79]:
%%sql 
-- Number of records of water sources for each location type

SELECT 
    location_type,
    COUNT(location_type) AS num_sources
FROM
    location
GROUP BY 
    location_type;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
2 rows affected.

[('Urban', 15910), ('Rural', 23740)]

In [80]:
%%sql 
-- Percentage of water sources in the Rural areas.

SELECT
    (23740/(15910+23740)*100) AS pct_rural_source

 * mysql+pymysql://root:***@localhost:3306/md_water_services
1 rows affected.

[(Decimal('59.8739'),)]

#### Diving into the Water Sources
There are different water source types for the number of people using each source. 
The analysis below answer the following questions.
1. How many people did we survey in total?
2. How many wells, taps and rivers are there?
3. How many people share particular types of water sources on avearge?
4. How many people are getting water from each type of source? 
5. How many people are getting water from each type of source in Percentage?

In [81]:
%%sql 
-- Number of people surveyed in total

SELECT 
    SUM(number_of_people_served) AS total_num_of_people_surveyed
FROM 
    water_source;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
1 rows affected.

[(Decimal('27628140'),)]

In [82]:
%%sql 
-- Total number of wells, taps and rivers

SELECT 
    type_of_water_source,
    COUNT(type_of_water_source) AS num_of_sources
FROM 
    Water_source
WHERE
    type_of_water_source IN ('well', 'river', 'shared_tap', 'tap_in_home_broken', 'tap_in_home')
GROUP BY 
    type_of_water_source

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('tap_in_home', 7265),
 ('tap_in_home_broken', 5856),
 ('well', 17383),
 ('shared_tap', 5767),
 ('river', 3379)]

In [83]:
%%sql
-- Average number of people served by each water source

SELECT 
    type_of_water_source,
    ROUND(AVG(number_of_people_served)) AS Avg_number_served
FROM 
    water_source
GROUP BY 
type_of_water_source;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('tap_in_home', Decimal('644')),
 ('tap_in_home_broken', Decimal('649')),
 ('well', Decimal('279')),
 ('shared_tap', Decimal('2071')),
 ('river', Decimal('699'))]

In [84]:
%%sql 
-- Total number of people served by each type of water

SELECT 
    type_of_water_source,
    SUM(number_of_people_served) AS total_num_of_people_served 
FROM    
    Water_source
GROUP BY 
    type_of_water_source
ORDER BY
    SUM(number_of_people_served) DESC;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('shared_tap', Decimal('11945272')),
 ('well', Decimal('4841724')),
 ('tap_in_home', Decimal('4678880')),
 ('tap_in_home_broken', Decimal('3799720')),
 ('river', Decimal('2362544'))]

In [58]:
%%sql 
-- Percentage of total number of people served by each type of water
-- NB:  27628140 is the total number of people surveyed in question one of this analysis

SELECT 
    type_of_water_source,
    SUM(number_of_people_served) AS total_num_of_people_served,
    ROUND(SUM(number_of_people_served)/27628140 *100) AS Pct_total_num_of_people_served 
FROM    
    Water_source
GROUP BY 
    type_of_water_source
ORDER BY
    SUM(number_of_people_served) DESC;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('shared_tap', Decimal('11945272'), Decimal('43')),
 ('well', Decimal('4841724'), Decimal('18')),
 ('tap_in_home', Decimal('4678880'), Decimal('17')),
 ('tap_in_home_broken', Decimal('3799720'), Decimal('14')),
 ('river', Decimal('2362544'), Decimal('9'))]

#### Start of a solution
Fixing or improving the water infrastructures are neccesary. The query below is analyzes the question, 
1. Which of type of water source should be fixed or imporved first?

In [11]:
%%sql 
-- Type of water source to fix or improve in their ranks

SELECT 
    type_of_water_source,
    SUM(number_of_people_served) AS population_served,
    RANK() OVER (
        ORDER BY SUM(number_of_people_served)DESC) AS rank_by_population
FROM
    water_source
GROUP BY
    type_of_water_source;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('shared_tap', Decimal('11945272'), 1),
 ('well', Decimal('4841724'), 2),
 ('tap_in_home', Decimal('4678880'), 3),
 ('tap_in_home_broken', Decimal('3799720'), 4),
 ('river', Decimal('2362544'), 5)]

#### Analyzing Queues
To gain insights on how long people queue to get water and the time it took for employees too collect data from the site, the following questions wil,l be addressed in the queries below.
1. How long did the survey take ?
2. What is the average total queue time for water?
3. What is the average queue time om different days?
4. How can we communicate the infomation efficiently?

In [44]:
%%sql 
-- Duration of the survey(in days)

SELECT 
    MAX(time_of_record) AS Max_time_of_record, 
    MIN(time_of_record) AS Min_time_of_record,
    DATEDIFF(MAX(time_of_record), MIN(time_of_record)) AS duration_of_survey
FROM
    visits;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
1 rows affected.

[(datetime.datetime(2023, 7, 14, 13, 53), datetime.datetime(2021, 1, 1, 9, 10), 924)]

In [64]:
%%sql
-- Average queue times 
-- NB: Some water sources have no queues so it is excluded

SELECT
    ROUND(AVG(NULLIF(time_in_queue,0))) AS Avg_queue_time
FROM 
    visits;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
1 rows affected.

[(Decimal('123'),)]